<template>
  <div class="container">
    <h1>О проекте</h1>
    <p>
      Изначально было желание сделать функционал, где вводится доступное
      количетво ходов и есть кнопка "Найти лучшие награды". При нажатии на
      кнопку рассчитывается путь. Карта это набор узлов, похоже на графы. Но при
      рассчете нужно учесть человеческий фактор: кому то выгодней взять
      изумруды, а кому то камни облика. Поэтому от этого функционала отказался.
      Пусть человек сам строит путь и получает нужные награды.
    </p>
    <p>Причины:</p>
    <ol>
      <li>
        На первой карте острова, когда было набрано большое количество ходов,
        рассчитать ходы и награды было сложно. Лучшие награды лежат в башнях.
        Башни расположены далеко от центра. Хватит ли ходов до них?... Сложно
        рассчитать, очень. Проще разметить путь как на листе бумаги.
      </li>
      <li>
        При доступной открытой карте также сложно было искать награды. Например,
        нужны изумруды, на карте сотня точек с разными картинками, среди которых
        не просто разглядеть нужную. Так надо еще и запомнить... Проще
        отфильтровать иконки.
      </li>
    </ol>
    <p>
      <router-link to="/contact">Приму любую обратную связь.</router-link>
      Что можно улучшить? Что лишнее? Что переделать? Что не работает?
    </p>
    <p>
      Сайт тестировался в Firefox последней версии, так что в других браузерах
      может что то не работать.
    </p>
    <p>
      Если кто то
      <router-link to="/help">желает помочь проекту</router-link> будет круто.
    </p>
  </div>
</template>
<script setup>
import { setMetaInfo } from "@/services/page-meta";

setMetaInfo({
  title: "О проекте",
  description:
    "В игре Хроники Хаоса на карте острова находятся узлы, чтобы их открыть нужно потратить ход исследователя. Ходы можно получить от событий игры. Соберем все призы вместе!",
  keywords:
    "Хроники хаоса, Эра доминиона, карта острова, карта, узлы, ресурсы, ходы исследователя, открытая карта",
});
</script>
